class articleSign {
  var articles = [
    {
      'ID': 1,
      'head': 'สัญญาณจราจรที่แสดงด้วยมือ',
      'paragraph':
          'ผู้ขับขี่ต้องปฏิบัติตามสัญญาณจราจรที่พนักงานเจ้าหน้าที่แสดงให้ปรากฏข้างหน้าในกรณีดังต่อไปนี้',
      'sub_article': [
        {
          'ID': 1,
          'text':
              '1. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนซ้ายออกไปเสมอระดับไหล่ ผู้ขับขี่ ซึ่งขับรถมาทางด้านหลังของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่ลดแขนข้างที่เหยียดออกไปนั้นลง และโบกมือไปข้างหน้า ให้ผู้ขับขี่ซึ่งหยุดรถอยู่ทางด้านหลังขับรถผ่านไปได้',
          'image': 'assets/images/article/sign/handSign-1.png'
        },
        {
          'ID': 2,
          'text':
              '2. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนข้างใดข้างหนึ่งออกไปเสมอระดับไหล่และตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านที่เหยียดแขนข้างนั้นของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่พลิกฝ่ามือที่ตั้งอยู่นั้นแล้วโบกผ่านศีรษะไปทางด้านหลัง ให้ผู้ขับขี่ซึ่งหยุดรถอยู่นั้นขับรถผ่านไปได้',
          'image': 'assets/images/article/sign/handSign-2.png'
        },
        {
          'ID': 3,
          'text':
              '3. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนทั้งสองข้างออกไปเสมอระดับไหล่ และตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านที่เหยียดแขนทั้งสองข้างของพนักงานเจ้าหน้าที่ต้องหยุดรถ',
          'image': 'assets/images/article/sign/handSign-3.png'
        },
        {
          'ID': 4,
          'text':
              '4. เมื่อพนักงานเจ้าหน้าที่ยืนและยกแขนขวาท่อนล่างตั้งฉากกับแขนท่อนบนและตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านหน้าของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่พลิกฝ่ามือที่ตั้งอยู่นั้นโบกไปด้านหลัง ให้ผู้ขับขี่ซึ่งหยุดรถอยู่ทางด้านหน้าของพนักงานเจ้าหน้าที่ขับรถผ่านไปได',
          'image': 'assets/images/article/sign/handSign-4.png'
        },
        {
          'ID': 5,
          'text':
              '5. เมื่อพนักงานเจ้าหน้าที่ยืนและยกแขนขวาท่อนล่างตั้งฉากกับแขนท่อนบนและตั้งฝ่ามือขึ้น ส่วนแขนซ้ายเหยียดออกไปเสมอระดับไหล่ ผู้ขับขี่ซึ่งขับรถมาทางด้านหน้าและด้านหลังของพนักงานเจ้าหน้าที่ต้องหยุดรถ',
          'image': 'assets/images/article/sign/handSign-5.png'
        },
      ],
    },
    {
      'ID': 2,
      'head': 'สัญญาณจราจรที่พนักงานเจ้าหน้าที่แสดงด้วยมือ',
      'paragraph':
          'ผู้ขับขี่ต้องปฏิบัติตามสัญญาณจราจรที่พนักงานเจ้าหน้าที่แสดงให้ปรากฏข้างหน้าในกรณีดังต่อไปนี้',
      'sub_article': [
        {
          'ID': 1,
          'text':
              '1. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนซ้ายออกไปเสมอระดับไหล่ ผู้ขับขี่ ซึ่งขับรถมาทางด้านหลังของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่ลดแขนข้างที่เหยียดออกไปนั้นลง และโบกมือไปข้างหน้า ให้ผู้ขับขี่ซึ่งหยุดรถอยู่ทางด้านหลังขับรถผ่านไปได้',
          'image': 'assets/images/article/sign/handSign-1.png'
        },
        {
          'ID': 2,
          'text':
              '2. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนข้างใดข้างหนึ่งออกไปเสมอระดับไหล่และตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านที่เหยียดแขนข้างนั้นของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่พลิกฝ่ามือที่ตั้งอยู่นั้นแล้วโบกผ่านศีรษะไปทางด้านหลัง ให้ผู้ขับขี่ซึ่งหยุดรถอยู่นั้นขับรถผ่านไปได้',
          'image': 'assets/images/article/sign/handSign-2.png'
        },
        {
          'ID': 3,
          'text':
              '3. เมื่อพนักงานเจ้าหน้าที่ยืนและเหยียดแขนทั้งสองข้างออกไปเสมอระดับไหล่ และตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านที่เหยียดแขนทั้งสองข้างของพนักงานเจ้าหน้าที่ต้องหยุดรถ',
          'image': 'assets/images/article/sign/handSign-3.png'
        },
        {
          'ID': 4,
          'text':
              '4. เมื่อพนักงานเจ้าหน้าที่ยืนและยกแขนขวาท่อนล่างตั้งฉากกับแขนท่อนบนและตั้งฝ่ามือขึ้น ผู้ขับขี่ซึ่งขับรถมาทางด้านหน้าของพนักงานเจ้าหน้าที่ต้องหยุดรถ แต่ถ้าพนักงานเจ้าหน้าที่พลิกฝ่ามือที่ตั้งอยู่นั้นโบกไปด้านหลัง ให้ผู้ขับขี่ซึ่งหยุดรถอยู่ทางด้านหน้าของพนักงานเจ้าหน้าที่ขับรถผ่านไปได',
          'image': 'assets/images/article/sign/handSign-4.png'
        },
        {
          'ID': 5,
          'text':
              '5. เมื่อพนักงานเจ้าหน้าที่ยืนและยกแขนขวาท่อนล่างตั้งฉากกับแขนท่อนบนและตั้งฝ่ามือขึ้น ส่วนแขนซ้ายเหยียดออกไปเสมอระดับไหล่ ผู้ขับขี่ซึ่งขับรถมาทางด้านหน้าและด้านหลังของพนักงานเจ้าหน้าที่ต้องหยุดรถ',
          'image': 'assets/images/article/sign/handSign-5.png'
        },
      ],
    },
  ];
  //เพิ่ม ข้อสอบเป็น 7 ข้อ เเละเปลี่ยนการอ่านเลขทั้งหมด เเละเป็นไม่สามารถอ่านได้
  articleSign();
}
